# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [22]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [31]:
s1 = pd.Series(np.random.randint(1, 5, size=100))
s2 = pd.Series(np.random.randint(1, 4, size=100))
s3 = pd.Series(np.random.randint(10000, 30001, size=100))

print(s1, s2, s3)

0     4
1     1
2     1
3     1
4     4
     ..
95    1
96    2
97    1
98    3
99    4
Length: 100, dtype: int64 0     3
1     1
2     2
3     3
4     1
     ..
95    1
96    3
97    2
98    2
99    3
Length: 100, dtype: int64 0     12918
1     14890
2     20113
3     21977
4     15492
      ...
95    20047
96    28053
97    11085
98    23861
99    25853
Length: 100, dtype: int64

### Step 3. Let's create a DataFrame by joinning the Series by column

In [24]:
df = pd.concat([s1, s2, s3], axis=1)
df

    0  1      2
0   1  3  28782
1   2  1  22407
2   1  3  20547
3   4  2  10376
4   2  1  16710
.. .. ..    ...
95  4  1  29562
96  3  1  22756
97  2  2  22519
98  4  3  12944
99  2  2  22522

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [25]:
df.columns = ['bedrs', 'bathrs', 'price_sqr_meter']
df

    bedrs  bathrs  price_sqr_meter
0       1       3            28782
1       2       1            22407
2       1       3            20547
3       4       2            10376
4       2       1            16710
..    ...     ...              ...
95      4       1            29562
96      3       1            22756
97      2       2            22519
98      4       3            12944
99      2       2            22522

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [33]:
bigcolumn = pd.concat([s1, s2, s3], axis=0).to_frame()
bigcolumn

        0
0       4
1       1
2       1
3       1
4       4
..    ...
95  20047
96  28053
97  11085
98  23861
99  25853

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [27]:
# No -- the indexes are kept, but the length of the DataFrame is 300
len(bigcolumn)

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [28]:
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn

         0
0        1
1        2
2        1
3        4
4        2
..     ...
295  29562
296  22756
297  22519
298  12944
299  22522

[300 rows x 1 columns]